GetCurrencyRates.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <tem:GetCurrencyRates>
            <tem:RateDate>2021-03-29</tem:RateDate>
        </tem:GetCurrencyRates>
    </soapenv:Body>
</soapenv:Envelope>